app/Controllers/Admin/Pajak.php

    public function index()
{
    $wilayah = $this->request->getGet('wilayah');
    $tanggalMulai = $this->request->getGet('tanggal_mulai');
    $tanggalSelesai = $this->request->getGet('tanggal_selesai');

    $query = $this->pajakModel
        ->select('pengajuan_pajak.*, petugas.nama as nama')
        ->join('petugas', 'petugas.id = pengajuan_pajak.id_petugas', 'left');


    if ($wilayah) {
        $query = $query->where('pengajuan_pajak.wilayah', $wilayah);
    }

    if ($tanggalMulai && $tanggalSelesai) {
        $query = $query->where("DATE(pengajuan_pajak.created_at) BETWEEN '$tanggalMulai' AND '$tanggalSelesai'");
    }

    $data['pengajuan'] = $query->orderBy('pengajuan_pajak.created_at', 'DESC')->findAll();
---
SELECT *
FROM `pengajuan_pajak`
ORDER BY `created_at` DESC